//
//  Story.swift
//  NPOProject
//
//  Created by Cid Hsieh on 2017/5/2.
//  Copyright © 2017年 Cid Hsieh. All rights reserved.
//

import Foundation

class Story {
    
    var story = ["飄著雨的傍晚，楊姊姊獨自坐在捷運的出口販賣商品，她是曾被「好事地圖」報導過的輪椅街賣者，認出來的原因是她穿著照片上的同一件衣服，我靠了過去買了一小包衛生紙，然後拿出手機告訴楊姊姊我在網路上看過她的故事，姊姊有些嚇到的直說謝謝，但姊姊並不知道自己的故事被放到網路上，生意也沒因此轉好，姊姊表示她因為身體不便而沒有工作，雖然有家人在照顧，她卻不想徒添別人麻煩，努力的自力更生，她從認識的商家批貨再到這邊來賣，為了讓生意能好一些，姊姊不論天氣如何都會出來賣，但再努力一天也就賺幾百元(一天才10個人來買)，效益很低卻也只能無奈繼續拚…。", "賣八寶粥的王太太，清晨6點就開始備料，煮好一天販賣的量就要四個鐘頭，中午忙著配送公司訂單，晚上再推著攤車到夜市販賣，生意興隆的她很難想像有一段困苦的過去。王太太長期受到家暴迫害，曾多次萌生自殺念頭，唯獨念在小女兒才一次次地撐下去，後來受到社福機構的幫助，才逐漸脫離了家暴家庭，成功離婚後一個人帶著小女兒到台北生活，因緣際會開始賣起八寶粥，一賣就是30年，看著女兒長大並嫁人王太太很是欣慰，自此決定將每日銷售前50碗八寶粥的收入全數捐給慈善機構，儘管生意時好時壞王太太仍然堅持做善事，因為她相信，受過一樣痛苦的人還有很多，如果能幫助到她們那就好了。", "捷運站旁的陰影處，坐在一桶桑葚旁的奶奶正忙著用塑膠盒分裝桑葚，埋頭苦幹的同時四處張望著有沒有客人。高齡82歲的奶奶住文山區，家中有一小畝地種種蔬果，吃不完就會拿到市場來賣，比較常在木柵市場，偶爾來七張這邊，雖然與兒媳、孫子三代同堂，但因他們愛吃辣又愛吃外食，奶奶則是完全不能吃辣，又加上兒媳長時間在外地忙，所以奶奶的生活與三餐都要自行打理。奶奶強調，種菜與賣菜都是為了生活，但我看著奶奶滿是風霜的雙手仍是覺得心疼，除了跟奶奶買桑葚之外，我還能替她做什麼呢？!", "我們走在四平街陽光商圈中，手中還拿著剛喝完的咖啡罐，碰巧看到一位阿嬤在前方收拾回收品，我們緩步靠近後，決定將手中的空罐子給這位阿嬤，本來只是單純想要解決手上的垃圾，卻聽到阿嬤用著沙啞的聲音回了聲謝謝，才發現這位阿嬤的臉上充滿著滄桑，我好奇的開始攀談：阿嬤已經75歲了，一個人獨居在附近，兒女不聞不問；原本是一位室內清潔員，因為視力與體力都變差就退休了，但為了生活還是必須掙錢，才開始出來撿回收，辛苦一天也就賺個一兩百夠花就好，很難想像阿嬤身體不適倒下的話該怎麼辦…後來阿嬤說她要趕著去整理回收物，拖著推車便走了。", "伯伯說，過去發生意外手腳斷過，所以無法正常工作，後來又罹患口腔癌，會發出非常惡臭的氣味，家人受不了，家庭關係急轉而下，於是自行離開家裡展開街友生活。後續透過好心人介紹，輾轉做了幾份工作，現在則是販售雜誌、玉蘭花來維生。黃伯伯有低收入戶補助，但都給家人，不過他們對伯伯都不聞不問。另外，黃伯伯也是頭頸愛關懷協會的志工會員，儘管生活困苦，他仍願意貢獻過去經驗來幫助同樣深受口腔癌所苦的人；黃伯伯的生意時好時壞，因為要定期複診檢查口腔癌，有時醫療費用是個很大的壓力，說到這邊，伯伯也只是坦然地說，那就繼續努力的賣吧。"]

}
